app/Controllers/dashboard.php

    public function inputBuku()
    {
        $validate = \Config\Services::validation();
        $validate->setRules([
            'judul' => 'required',
            'pengarang' => 'required',
            'penerbit' => 'required',
            'tahun_terbit' => 'required',
            'jumlah_halaman' => 'required',
            'sinopsis' => 'required',
        ]);

        if ($validate->withRequest($this->request)->run()) {
            $judul = $this->request->getPost('judul');
            $pengarang = $this->request->getPost('pengarang');
            $penerbit = $this->request->getPost('penerbit');
            $tahun_terbit = $this->request->getPost('tahun_terbit');
            $jumlah_halaman = $this->request->getPost('jumlah_halaman');
            $sinopsis = $this->request->getPost('sinopsis');
            $data = [
                'judul' => $judul,
                'pengarang' => $pengarang,
                'penerbit' => $penerbit,
                'tahun_terbit' => $tahun_terbit,
                'jumlah_halaman' => $jumlah_halaman,
                'sinopsis' => $sinopsis,
            ];
            $anggotaModel = new bukuModel();
            $anggotaModel->insert($data);
---
INSERT INTO `buku` (`judul`, `pengarang`, `penerbit`, `tahun_terbit`, `jumlah_halaman`, `sinopsis`) VALUES ('aaaaaaaaa', 'aaaaaaaaaa', 'aaaaaaaaaaa', '2123', '1231', 'aaaaaaaaaaaaaaaaa')