app/Models/bukuModel.php

SELECT *
FROM `buku`
---
    public function getBuku()
    {
        return $this->findAll();