app/Models/kategoriModel.php

SELECT *
FROM `kategori`
---
    public function getKategori()
    {
        return $this->findAll();